/*
输出21世纪中截止某个年份以来的所有闰年年份。
注意：闰年的判别条件是该年年份能被4整除但不能被100整除、或者能被400整除。

输入格式:
输入在一行中给出21世纪的某个截止年份。

输出格式:
逐行输出满足条件的所有闰年年份，即每个年份占一行。
输入若非21世纪的年份则输出"Invalid year!"。若不存在任何闰年，则输出“None”。

输入样例1:
2048
结尾无空行
输出样例1:
2004
2008
2012
2016
2020
2024
2028
2032
2036
2040
2044
2048
结尾无空行
输入样例2:
2000
输出样例2:
Invalid year!
*/
#include <stdio.h>
int main(void)
{
	int N=0;
	int x = 0;
	scanf("%d",&N);
	if (N > 2000 && N <= 2100){
		for (int i = 2001; i <= N; ++i){
			if (i % 4 == 0)
			{
				if (i % 100 != 0)
				{
					x = 1;
					printf("%d\n",i );
				}
			}
		}
		if (x == 0){
			printf("None\n");
		}
	}else{
		printf("Invalid year!\n");
	}
	return 0;
}